Podkova/src/Enums/ВидыЦенностей/ВидыЦенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЦенностей</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные0</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПотребление</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученных</name>
  </enumValues>
  <enumValues>
    <name>ИмуществоСУчетомНДС</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентАренда</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентРеализацияИмущества</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентИностранцы</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентКомитент</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыНезавершенногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ОС</name>
  </enumValues>
  <enumValues>
    <name>ПосредническиеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРаботыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>СМРПодрядные</name>
  </enumValues>
  <enumValues>
    <name>СМРСобственнымиСилами</name>
  </enumValues>
  <enumValues>
    <name>СуммыСвязанныеСРасчетамиПоОплате</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежи</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныеПлатежиОС</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ТаможенныйСоюз</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученныеНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ВозвратАвансовПолученныхНалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>УслугиНеНаТерриторииРФ</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ВидыАгентскихДоговоров/ВидыАгентскихДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыАгентскихДоговоров</name>
  <comment>Виды договоров, согласно которым организация выступает в качестве налогового агента</comment>
  <enumValues>
    <name>Аренда</name>
    <comment>Договор аренды муниципального имущества</comment>
  </enumValues>
  <enumValues>
    <name>РеализацияИмущества</name>
    <comment>Договор покупки государственного или муниципального имущества</comment>
  </enumValues>
  <enumValues>
    <name>Нерезидент</name>
    <comment>Договор с контрагентом (иностранной компанией) не являющимся плательщиком НДС</comment>
  </enumValues>
  <enumValues>
    <name>НерезидентЭлектронныеУслуги</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ВидыЦенностей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает вид ценности, соответствующий виду переданного договора налогового агента.
// Параметры
//     ВидАгентскогоДоговора - ПеречислениеСсылка.ВидыАгентскихДоговоров.
// Возвращаемое значение:
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
Функция ВидЦенностиПоВидуАгентскогоДоговора(ВидАгентскогоДоговора) Экспорт
	
	Если ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Аренда Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентАренда;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.РеализацияИмущества Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент Тогда 
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы;
	ИначеЕсли ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.НерезидентЭлектронныеУслуги Тогда
		Возврат Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги;
	КонецЕсли;
	
КонецФункции

// Определяет, относится ли переданный вид ценности к операциям налогового агента по НДС.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности относится к операциям налогового агента по НДС,
//              Ложь - вид ценности не относится к операциям налогового агента по НДС.
Функция ЭтоНалоговыйАгент(ВидЦенности) Экспорт
	
	ВидыЦенностейНалоговогоАгента = МассивВидовЦенностиНалоговыйАгент();
	Возврат ВидыЦенностейНалоговогоАгента.Найти(ВидЦенности) <> Неопределено;
	
КонецФункции

// Определяет, относится ли переданный вид ценности к операциям налогового агента по НДС за нерезидента.
// Анализируется только налоговый агент по приобретению, налоговый агент при реализации комиссионных товаров
// или услуг в данной функции не рассматривается.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности относится к операциям налогового агента по НДС за нерезидента,
//              Ложь - вид ценности не относится к операциям налогового агента по НДС за нерезидента.
Функция ЭтоНалоговыйАгентЗаНерезидента(ВидЦенности) Экспорт
	
	Если ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы
		ИЛИ ВидЦенности = Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к операциям налогового агента по НДС.
// Параметры
//     ВключаяКомиссионныеОперации - Булево - признак необходимости включения в состав возвращаемого массива
//                                            операций реализации ценностей комитента-нерезидента.
//     ВключаяОбратноеНачисление   - Булево - признак необходимости включения в состав возвращаемого массива
//                                            операций реализации товаров п.8 ст. 161 НК.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгент(
		ВключаяКомиссионныеОперации = Истина, ВключаяОбратноеНачисление = Ложь) Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентЭлектронныеУслуги);
	
	Если ВключаяКомиссионныеОперации Тогда
		ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентКомитент);
	КонецЕсли;
	
	Если ВключаяОбратноеНачисление Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ВидыЦенностей,
			МассивВидовЦенностиНалоговыйАгентРеализацияТоваров());
	КонецЕсли;
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, по которым производится поиск счета-фактуры с учетом договора.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностейУчитывающихсяПоДоговорам() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученных);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ВидыЦенностей,
		МассивВидовЦенностиНалоговыйАгент());
		
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ВидыЦенностей,
		МассивВидовЦенностиНалоговыйАгентРеализацияТоваров());
		
	Возврат ВидыЦенностей;
	
КонецФункции
	
// Определяет, производится ли поиск счета-фактуры по переданному виду ценности с учетом договора.
// Параметры
//     ВидЦенности - ПеречислениеСсылка.ВидыЦенностей.
// Возвращаемое значение: 
//     Булево - Истина - вид ценности учитывается по договорам,
//              Ложь - вид ценности не учитывается по договорам.
Функция УчитываетсяПоДоговорам(ВидЦенности) Экспорт
	
	ВидыЦенностейУчитывающиесяПоДоговорам = МассивВидовЦенностейУчитывающихсяПоДоговорам();
	Возврат ВидыЦенностейУчитывающиесяПоДоговорам.Найти(ВидЦенности) <> Неопределено;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к операциям налогового агента при покупке товаров,
// указанных в п.8 ст. 161 НК РФ.
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
Функция МассивВидовЦенностиНалоговыйАгентРеализацияТоваров() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыВыданныеНалоговыйАгент);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученныеНалоговыйАгент);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ВозвратАвансовПолученныхНалоговыйАгент);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ТоварыНалоговыйАгент);
	
	Возврат ВидыЦенностей;
	
КонецФункции

// Возвращает массив видов ценностей, относящихся к услугам и доп. расходам.
//
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
//
Функция МассивВидовЦенностиУслугДляУчетаСебестоимости() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги);
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ЭлектронныеУслуги);
	
	Возврат ВидыЦенностей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
